Day-14/wing_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    top
    {
	type		noSlip;
    }

    bottom
    {
	type		noSlip;
    }

    left
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    right
    {
	type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;	
    }

    front
    {
	type		noSlip;
    }

    back
    {
	type		noSlip;
    }

    wing
    {
	type		noSlip;
    }
}


// ************************************************************************* //
